{
  "name": "MACKENZIE — Dissertativo-argumentativo (operacional 2025)",
  "institution": "MACKENZIE",
  "version": "2025-11-22",
  "source_type": "operacional_alinhado_editais",
  "source_pdf": "rubrics_oficiais/fontes/MACKENZIE/MACKENZIE_2025.pdf",
  "scale": 100,

  "rules": [
    {
      "id": "nota_zero_condicoes",
      "label": "Condições de nota zero",
      "criterion_ids": ["C1", "C2", "C3", "C4"],
      "type": "cap_level",
      "max_level": 0,
      "when": "Texto em branco; fuga total ao tema; tipo de texto inadequado (não dissertativo-argumentativo); cópia extensa (mais de 3 linhas) da coletânea ou de outra fonte; desrespeito às regras básicas do edital (como quantidade mínima de linhas).",
      "explanation_required": true
    },
    {
      "id": "repertorio_obrigatorio_C2",
      "label": "Repertório verificável na argumentação (C2)",
      "criterion_ids": ["C2"],
      "type": "cap_if_no_repertoire",
      "max_level": 2,
      "when": "Argumentação baseada quase exclusivamente em senso comum, sem uso de exemplos, dados, autores, leis, obras, fatos históricos ou estudos reconhecíveis.",
      "explanation_required": true
    }
  ],

  "criteria": [
    {
      "id": "C1",
      "name": "Tema e proposta (recorte + atendimento às instruções)",
      "weight": 0.25,
      "levels": {
        "0": "Fuga total ao tema ou não realização da proposta (desconsidera textos motivadores e instruções centrais).",
        "1": "Atendimento muito parcial; foco frágil; recorte pouco relacionado à proposta.",
        "2": "Atende de forma básica; recorte genérico; nem todas as instruções são contempladas.",
        "3": "Boa aderência; recorte pertinente; respeita a proposta e os textos motivadores.",
        "4": "Aderência plena; problematização consistente; recorte bem delimitado.",
        "5": "Aderência exemplar; recorte preciso e aprofundado; demonstra leitura crítica dos motivadores."
      }
    },
    {
      "id": "C2",
      "name": "Argumentação e coerência global",
      "weight": 0.25,
      "levels": {
        "0": "Ausência de ponto de vista sustentado; ideias desconexas; contradições graves.",
        "1": "Tese pouco clara; argumentos frágeis e genéricos; conclusões pouco relacionadas ao desenvolvimento.",
        "2": "Argumentação básica, previsível; há linha de raciocínio, mas com pouca exploração e quase nenhum apoio verificável.",
        "3": "Coerência global adequada; tese clara; ao menos um apoio verificável (dado, exemplo concreto, referência a autor, lei ou obra) relacionado e comentado.",
        "4": "Argumentação consistente; múltiplos apoios bem integrados; explora causas, consequências e contrapontos de modo organizado.",
        "5": "Argumentação densa e crítica; repertório variado e preciso; discute implicações, limites e perspectivas do tema com maturidade."
      }
    },
    {
      "id": "C3",
      "name": "Coesão e estrutura (organização do texto)",
      "weight": 0.25,
      "levels": {
        "0": "Sem estrutura reconhecível (parágrafos inexistentes ou caóticos); progressão comprometida.",
        "1": "Estrutura muito frágil; introdução, desenvolvimento e conclusão pouco diferenciados; coesão precária.",
        "2": "Estrutura básica, com introdução, desenvolvimento e conclusão identificáveis, porém com transições pobres e paragrafação irregular.",
        "3": "Estrutura adequada; progressão clara de ideias; paragrafação funcional; uso suficiente de conectores.",
        "4": "Estrutura consistente; transições bem marcadas; uso variado e adequado de mecanismos coesivos.",
        "5": "Estrutura exemplar; organização estratégica dos parágrafos a serviço da tese; coesão refinada em nível micro e macrotextual."
      }
    },
    {
      "id": "C4",
      "name": "Norma-padrão e expressão escrita",
      "weight": 0.25,
      "levels": {
        "0": "Graves inadequações de registro; múltiplos desvios de ortografia, flexão, pontuação e concordância que comprometem a compreensão.",
        "1": "Muitos desvios de norma-padrão e forte interferência de oralidade; leitura bastante prejudicada.",
        "2": "Alguns desvios recorrentes; prejuízos pontuais à clareza; vocabulário pouco variado.",
        "3": "Poucos desvios; registro globalmente adequado; vocabulário apropriado ao contexto formal.",
        "4": "Raros deslizes; boa precisão sintática, ortográfica e lexical; fraseado claro e fluente.",
        "5": "Domínio excelente da norma-padrão escrita; correção e clareza acompanhadas de boa apuração vocabular e estilo compatível com o vestibular."
      }
    }
  ],

  "notes": "Rúbrica operacional alinhada aos eixos descritos nos materiais de preparação do Mackenzie (tema/proposta, argumentação/coerência, coesão/estrutura e correção linguística), com pesos iguais entre os quatro critérios."
}