{
  "name": "PUC-SP — Dissertativo-argumentativo (operacional 2026)",
  "institution": "PUC-SP",
  "version": "2025-11-22",
  "source_type": "operacional_alinhado_editais",
  "source_pdf": "rubrics_oficiais/fontes/PUC_SP/PUC_2026.pdf",
  "scale": 100,

  "rules": [
    {
      "id": "nota_zero_condicoes",
      "label": "Condições de nota zero",
      "criterion_ids": ["C1", "C2", "C3", "C4"],
      "type": "cap_level",
      "max_level": 0,
      "when": "Texto em branco; fuga total ao tema; tipo de texto inadequado (não dissertativo-argumentativo); cópia extensa (mais de 3 linhas) da coletânea ou de outra fonte; desrespeito às regras básicas do edital.",
      "explanation_required": true
    },
    {
      "id": "repertorio_obrigatorio_C2",
      "label": "Repertório verificável na argumentação (C2)",
      "criterion_ids": ["C2"],
      "type": "cap_if_no_repertoire",
      "max_level": 2,
      "when": "Ausência de repertório verificável além do senso comum (autores/obras, dados/estatísticas, leis, estudos, fatos históricos, casos concretos) articulado à tese e aos argumentos.",
      "explanation_required": true
    }
  ],

  "criteria": [
    {
      "id": "C1",
      "name": "Tipo de texto e tema (gênero + proposta)",
      "weight": 0.25,
      "levels": {
        "0": "Fuga total ao tema OU não realização da proposta OU não configura dissertação.",
        "1": "Atendimento muito parcial ao tema/proposta; foco frágil; tipo de texto apenas parcialmente reconhecível.",
        "2": "Atende de forma básica ao tema/proposta; tipo de texto globalmente adequado, mas com desvios; objetivos pouco definidos.",
        "3": "Boa aderência ao tema; proposta atendida; configura dissertação com interlocução reconhecível.",
        "4": "Aderência plena; recorte pertinente e bem delimitado; escolhas de gênero coerentes com a situação proposta.",
        "5": "Aderência exemplar; recorte preciso e aprofundado; uso maduro do gênero dissertativo-argumentativo em consonância com a proposta."
      }
    },
    {
      "id": "C2",
      "name": "Coerência e argumentação (ideias, autoria, repertório)",
      "weight": 0.25,
      "levels": {
        "0": "Ideias desconexas; contradições graves; ausência de tese ou de ponto de vista identificável.",
        "1": "Coerência global muito frágil; argumentos genéricos; conclusões frágeis; predomínio de senso comum.",
        "2": "Argumentação básica; linha de raciocínio reconhecível, porém previsível; pouca sustentação verificável.",
        "3": "Coerência global adequada; tese clara; ao menos um apoio verificável (dado/autor/lei/estudo/caso) relacionado e comentado.",
        "4": "Coerência consistente; desenvolvimento articulado; repertório variado e pertinente, integrado ao raciocínio.",
        "5": "Coerência exemplar; argumentação densa e crítica; repertório variado e preciso, explorando contrapontos, implicações e limites do ponto de vista."
      }
    },
    {
      "id": "C3",
      "name": "Coesão e organização (progressão + paragrafação)",
      "weight": 0.25,
      "levels": {
        "0": "Fragmentação extrema; ausência de progressão; paragrafação inexistente ou caótica.",
        "1": "Encadeamento precário; conectores pouco adequados; repetição excessiva; parágrafos mal delimitados.",
        "2": "Encadeamento básico; conectores funcionais, porém pouco variados; paragrafação simples, com algumas falhas.",
        "3": "Boa progressão temática; uso adequado de conectores e retomadas; paragrafação funcional (introdução, desenvolvimento e conclusão).",
        "4": "Coesão consistente; transições claras entre parágrafos; gerenciamento eficiente de referências e elos coesivos.",
        "5": "Coesão exemplar; encadeamento refinado de ideias; paragrafação estratégica a serviço da argumentação."
      }
    },
    {
      "id": "C4",
      "name": "Norma-padrão e expressão (correção + estilo)",
      "weight": 0.25,
      "levels": {
        "0": "Graves inadequações de registro; múltiplos desvios de ortografia, flexão, pontuação e concordância que comprometem a compreensão.",
        "1": "Muitos desvios de norma-padrão e marcas fortes de oralidade; leitura prejudicada em vários trechos.",
        "2": "Alguns desvios recorrentes; interferências pontuais na clareza; vocabulário limitado ou pouco preciso.",
        "3": "Poucos desvios; registro globalmente adequado ao contexto formal; vocabulário apropriado.",
        "4": "Raros deslizes; boa precisão sintática, ortográfica e lexical; estilo claro e fluente.",
        "5": "Domínio excelente da norma-padrão escrita; clareza, precisão e propriedade estilística, sem prejuízo da objetividade exigida no vestibular."
      }
    }
  ],

  "notes": "Rúbrica operacional alinhada aos eixos divulgados pela PUC-SP (tipo de texto, tema, coerência, coesão e norma-padrão), com pesos iguais entre os quatro critérios."
}